---
kind: type
id: T:Autodesk.Revit.DB.Infrastructure.HorizontalCurveType
source: html/786ce1c0-79de-428d-136f-265dc4cffe78.htm
---
# Autodesk.Revit.DB.Infrastructure.HorizontalCurveType

Represents the curve types for the horizontal curves which define Alignment geometry.

## Syntax (C#)
```csharp
public enum HorizontalCurveType
```